{
  "_name_or_path": "Geotrend/distilbert-base-en-fr-cased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Awards",
    "1": "Certificates",
    "2": "Personal_Info",
    "3": "Education",
    "4": "Interests",
    "5": "Languages",
    "6": "para",
    "7": "Work_Experience",
    "8": "Projects",
    "9": "Skills1",
    "10": "Skills2",
    "11": "Summary"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Awards": 0,
    "Certificates": 1,
    "Personal_Info": 2,
    "Education": 3,
    "Interests": 4,
    "Languages": 5,
    "para": 6,
    "Work_Experience": 7,
    "Projects": 8,
    "Skills1": 9,
    "Skills2": 10,
    "Summary": 11
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "problem_type": "multi_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.21.3",
  "vocab_size": 33407
}
